Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсполнительОбращений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>125</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДПользователя</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступВыдан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>добавитьВПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//колЗадачСегодня = Неопределено;
	//Если ЗначениеЗаполнено(Данные.Ссылка.ИсполнительОбращений) Тогда
	//	колЗадачСегодня = ПолучитьСтатистикуИсполнителя(Данные.Ссылка);
	//КонецЕсли;
	//Представление = Данные.Ссылка.ПолноеИмя + ?(колЗадачСегодня <> Неопределено, (" (" + колЗадачСегодня + ")"), "");
	Представление = Данные.Ссылка.ПолноеИмя + 
	?(ЗначениеЗаполнено(Данные.Ссылка.добавитьВПредставление),
	" (" + Строка(Данные.Ссылка.добавитьВПредставление) + ")", "");
	                                         	
КонецПроцедуры

Функция ПолучитьСтатистикуИсполнителя(Исполнитель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК шт,
		|	ЗадачаСоздатьПользователяУчетныеДанные.Ссылка.БизнесПроцесс КАК Ссылка,
		|	ЗадачаСоздатьПользователяУчетныеДанные.Ссылка.БизнесПроцесс.Исполнитель КАК Исполнитель
		|ПОМЕСТИТЬ ВТКол
		|ИЗ
		|	Задача.ЗадачаСоздатьПользователя.УчетныеДанные КАК ЗадачаСоздатьПользователяУчетныеДанные
		|ГДЕ
		|	(
		|		ЗадачаСоздатьПользователяУчетныеДанные.Ссылка.Дата >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
		|		И ЗадачаСоздатьПользователяУчетныеДанные.Ссылка.БизнесПроцесс.Исполнитель = &Исполнитель
		|		И ЗадачаСоздатьПользователяУчетныеДанные.Ссылка.БизнесПроцесс.Исполнитель.ИсполнительОбращений
		|	) ИЛИ (
		|		ЗадачаСоздатьПользователяУчетныеДанные.Ссылка.БизнесПроцесс.РуководительИТ
		|		И НЕ ЗадачаСоздатьПользователяУчетныеДанные.Ссылка.БизнесПроцесс.Завершен
		|		И ЗадачаСоздатьПользователяУчетныеДанные.Ссылка.БизнесПроцесс.Исполнитель = &Исполнитель
		//|		И ЗадачаСоздатьПользователяУчетныеДанные.Ссылка.БизнесПроцесс.Исполнитель.ИсполнительОбращений
		|	)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадачаСоздатьПользователяУчетныеДанные.Ссылка.БизнесПроцесс,
		|	ЗадачаСоздатьПользователяУчетныеДанные.Ссылка.БизнесПроцесс.Исполнитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ВТКол.шт) КАК сегодняЗадач
		|ИЗ
		|	ВТКол КАК ВТКол
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТКол.Исполнитель";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.сегодняЗадач;
	КонецЕсли;
	
	Возврат Неопределено;	
КонецФункции

Процедура ПечатьДоступ(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьДоступ)
	Макет = Справочники.Пользователи.ПолучитьМакет("ПечатьДоступ");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.АдресЭлектроннойПочты,
	|	Пользователи.Наименование
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
